/****************************************************
	文件：BattleConfig.cs
	作者：孙淳
	邮箱: 1832259562@qq.com
	日期：2024/05/15 12:01   	
	功能：战斗配置
*****************************************************/
using Lockstep.Math;
using System;
using UnityEngine;

[Serializable]
class BattleConfig
{
	//出生点配置
	public static float[,,] birthConfig = new float[2, 5, 6]
	{
		//蓝1
		{
            {-5.07f, 0.20f, -4.48f, 0, 0, 0},//出生点1
			{-2.97f,0.20f,-3.83f, 0, 0, 0},//出生点2
			{-1.6f,0.20f,-5.52f, 0, 0, 0},//出生点3
			{-4.94f,0.20f,-6.66f, 0, 0, 0},//出生点4
			{-3.12f,0.20f,-6.98f, 0, 0, 0},//出生点5
		},
		//红2
		{
            {-97.73f,0.20f,-101.16f, 0, 180f,  0},//出生点1
			{-96.04f,0.20f,-99.87f, 0, 180f, 0},//出生点2
			{-96.44f,0.20f,-97.84f,  0, 180f, 0},//出生点3
			{-98.87f,0.20f,-98.01f, 0, 180f, 0},//出生点4
			{-99.27f,0.20f,-99.94f, 0, 180f, 0},//出生点5
		},
	};
	//技能配置:ID,伤害
	public static int[] skillConfig = new int[]
	{
		25,//普攻伤害
	};
	//碰撞层
	public enum CollionLayer
    {
		//静态
		Static,
		//蓝方
		Blue,
		//红方
		Red,
    }
}

